# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Wed Mar 25 02:13:10 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design rr_arbiter

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 0.2 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {req[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports rst_n]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {grant[0]}]
set_clock_uncertainty -setup 0.05 [get_clocks clk]
set_clock_uncertainty -hold 0.05 [get_clocks clk]
